xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD46 */
#define IFX_PSI5_CH_SORH_SD46_OFF (14u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD47 */
#define IFX_PSI5_CH_SORH_SD47_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD47 */
#define IFX_PSI5_CH_SORH_SD47_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD47 */
#define IFX_PSI5_CH_SORH_SD47_OFF (15u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD48 */
#define IFX_PSI5_CH_SORH_SD48_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD48 */
#define IFX_PSI5_CH_SORH_SD48_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD48 */
#define IFX_PSI5_CH_SORH_SD48_OFF (16u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD49 */
#define IFX_PSI5_CH_SORH_SD49_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD49 */
#define IFX_PSI5_CH_SORH_SD49_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD49 */
#define IFX_PSI5_CH_SORH_SD49_OFF (17u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD50 */
#define IFX_PSI5_CH_SORH_SD50_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD50 */
#define IFX_PSI5_CH_SORH_SD50_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD50 */
#define IFX_PSI5_CH_SORH_SD50_OFF (18u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD51 */
#define IFX_PSI5_CH_SORH_SD51_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD51 */
#define IFX_PSI5_CH_SORH_SD51_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD51 */
#define IFX_PSI5_CH_SORH_SD51_OFF (19u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD52 */
#define IFX_PSI5_CH_SORH_SD52_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD52 */
#define IFX_PSI5_CH_SORH_SD52_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD52 */
#define IFX_PSI5_CH_SORH_SD52_OFF (20u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD53 */
#define IFX_PSI5_CH_SORH_SD53_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD53 */
#define IFX_PSI5_CH_SORH_SD53_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD53 */
#define IFX_PSI5_CH_SORH_SD53_OFF (21u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD54 */
#define IFX_PSI5_CH_SORH_SD54_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD54 */
#define IFX_PSI5_CH_SORH_SD54_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD54 */
#define IFX_PSI5_CH_SORH_SD54_OFF (22u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD55 */
#define IFX_PSI5_CH_SORH_SD55_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD55 */
#define IFX_PSI5_CH_SORH_SD55_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD55 */
#define IFX_PSI5_CH_SORH_SD55_OFF (23u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD56 */
#define IFX_PSI5_CH_SORH_SD56_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD56 */
#define IFX_PSI5_CH_SORH_SD56_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD56 */
#define IFX_PSI5_CH_SORH_SD56_OFF (24u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD57 */
#define IFX_PSI5_CH_SORH_SD57_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD57 */
#define IFX_PSI5_CH_SORH_SD57_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD57 */
#define IFX_PSI5_CH_SORH_SD57_OFF (25u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD58 */
#define IFX_PSI5_CH_SORH_SD58_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD58 */
#define IFX_PSI5_CH_SORH_SD58_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD58 */
#define IFX_PSI5_CH_SORH_SD58_OFF (26u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD59 */
#define IFX_PSI5_CH_SORH_SD59_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD59 */
#define IFX_PSI5_CH_SORH_SD59_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD59 */
#define IFX_PSI5_CH_SORH_SD59_OFF (27u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD60 */
#define IFX_PSI5_CH_SORH_SD60_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD60 */
#define IFX_PSI5_CH_SORH_SD60_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD60 */
#define IFX_PSI5_CH_SORH_SD60_OFF (28u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD61 */
#define IFX_PSI5_CH_SORH_SD61_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD61 */
#define IFX_PSI5_CH_SORH_SD61_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD61 */
#define IFX_PSI5_CH_SORH_SD61_OFF (29u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD62 */
#define IFX_PSI5_CH_SORH_SD62_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD62 */
#define IFX_PSI5_CH_SORH_SD62_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD62 */
#define IFX_PSI5_CH_SORH_SD62_OFF (30u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD63 */
#define IFX_PSI5_CH_SORH_SD63_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD63 */
#define IFX_PSI5_CH_SORH_SD63_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD63 */
#define IFX_PSI5_CH_SORH_SD63_OFF (31u)

/** \brief Length for Ifx_PSI5_INTOV_Bits.RSI */
#define IFX_PSI5_INTOV_RSI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTOV_Bits.RSI */
#define IFX_PSI5_INTOV_RSI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTOV_Bits.RSI */
#define IFX_PSI5_INTOV_RSI_OFF (0u)

/** \brief Length for Ifx_PSI5_INTOV_Bits.RDI */
#define IFX_PSI5_INTOV_RDI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTOV_Bits.RDI */
#define IFX_PSI5_INTOV_RDI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTOV_Bits.RDI */
#define IFX_PSI5_INTOV_RDI_OFF (1u)

/** \brief Length for Ifx_PSI5_INTOV_Bits.RBI */
#define IFX_PSI5_INTOV_RBI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTOV_Bits.RBI */
#define IFX_PSI5_INTOV_RBI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTOV_Bits.RBI */
#define IFX_PSI5_INTOV_RBI_OFF (2u)

/** \brief Length for Ifx_PSI5_INTOV_Bits.TDI */
#define IFX_PSI5_INTOV_TDI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTOV_Bits.TDI */
#define IFX_PSI5_INTOV_TDI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTOV_Bits.TDI */
#define IFX_PSI5_INTOV_TDI_OFF (3u)

/** \brief Length for Ifx_PSI5_INTOV_Bits.TBI */
#define IFX_PSI5_INTOV_TBI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTOV_Bits.TBI */
#define IFX_PSI5_INTOV_TBI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTOV_Bits.TBI */
#define IFX_PSI5_INTOV_TBI_OFF (4u)

/** \brief Length for Ifx_PSI5_INTOV_Bits.ERRI */
#define IFX_PSI5_INTOV_ERRI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTOV_Bits.ERRI */
#define IFX_PSI5_INTOV_ERRI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTOV_Bits.ERRI */
#define IFX_PSI5_INTOV_ERRI_OFF (5u)

