xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxPsi5_bf.h
/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI4 */
#define IFX_PSI5_RMIOV_RMI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI4 */
#define IFX_PSI5_RMIOV_RMI4_OFF (4u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI5 */
#define IFX_PSI5_RMIOV_RMI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI5 */
#define IFX_PSI5_RMIOV_RMI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI5 */
#define IFX_PSI5_RMIOV_RMI5_OFF (5u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI6 */
#define IFX_PSI5_RMIOV_RMI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI6 */
#define IFX_PSI5_RMIOV_RMI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI6 */
#define IFX_PSI5_RMIOV_RMI6_OFF (6u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI7 */
#define IFX_PSI5_RMIOV_RMI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI7 */
#define IFX_PSI5_RMIOV_RMI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI7 */
#define IFX_PSI5_RMIOV_RMI7_OFF (7u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI8 */
#define IFX_PSI5_RMIOV_RMI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI8 */
#define IFX_PSI5_RMIOV_RMI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI8 */
#define IFX_PSI5_RMIOV_RMI8_OFF (8u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI9 */
#define IFX_PSI5_RMIOV_RMI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI9 */
#define IFX_PSI5_RMIOV_RMI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI9 */
#define IFX_PSI5_RMIOV_RMI9_OFF (9u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI10 */
#define IFX_PSI5_RMIOV_RMI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI10 */
#define IFX_PSI5_RMIOV_RMI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI10 */
#define IFX_PSI5_RMIOV_RMI10_OFF (10u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI11 */
#define IFX_PSI5_RMIOV_RMI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI11 */
#define IFX_PSI5_RMIOV_RMI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI11 */
#define IFX_PSI5_RMIOV_RMI11_OFF (11u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI12 */
#define IFX_PSI5_RMIOV_RMI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI12 */
#define IFX_PSI5_RMIOV_RMI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI12 */
#define IFX_PSI5_RMIOV_RMI12_OFF (12u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI13 */
#define IFX_PSI5_RMIOV_RMI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI13 */
#define IFX_PSI5_RMIOV_RMI13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI13 */
#define IFX_PSI5_RMIOV_RMI13_OFF (13u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI14 */
#define IFX_PSI5_RMIOV_RMI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI14 */
#define IFX_PSI5_RMIOV_RMI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI14 */
#define IFX_PSI5_RMIOV_RMI14_OFF (14u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI15 */
#define IFX_PSI5_RMIOV_RMI15_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI15 */
#define IFX_PSI5_RMIOV_RMI15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI15 */
#define IFX_PSI5_RMIOV_RMI15_OFF (15u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI16 */
#define IFX_PSI5_RMIOV_RMI16_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI16 */
#define IFX_PSI5_RMIOV_RMI16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI16 */
#define IFX_PSI5_RMIOV_RMI16_OFF (16u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI17 */
#define IFX_PSI5_RMIOV_RMI17_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI17 */
#define IFX_PSI5_RMIOV_RMI17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI17 */
#define IFX_PSI5_RMIOV_RMI17_OFF (17u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI18 */
#define IFX_PSI5_RMIOV_RMI18_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI18 */
#define IFX_PSI5_RMIOV_RMI18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI18 */
#define IFX_PSI5_RMIOV_RMI18_OFF (18u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI19 */
#define IFX_PSI5_RMIOV_RMI19_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI19 */
#define IFX_PSI5_RMIOV_RMI19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI19 */
#define IFX_PSI5_RMIOV_RMI19_OFF (19u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI20 */
#define IFX_PSI5_RMIOV_RMI20_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI20 */
#define IFX_PSI5_RMIOV_RMI20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI20 */
#define IFX_PSI5_RMIOV_RMI20_OFF (20u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI21 */
#define IFX_PSI5_RMIOV_RMI21_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI21 */
#define IFX_PSI5_RMIOV_RMI21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI21 */
#define IFX_PSI5_RMIOV_RMI21_OFF (21u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI22 */
#define IFX_PSI5_RMIOV_RMI22_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI22 */
#define IFX_PSI5_RMIOV_RMI22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI22 */
#define IFX_PSI5_RMIOV_RMI22_OFF (22u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI23 */
#define IFX_PSI5_RMIOV_RMI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI23 */
#define IFX_PSI5_RMIOV_RMI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI23 */
#define IFX_PSI5_RMIOV_RMI23_OFF (23u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI24 */
#define IFX_PSI5_RMIOV_RMI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI24 */
#define IFX_PSI5_RMIOV_RMI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI24 */
#define IFX_PSI5_RMIOV_RMI24_OFF (24u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI25 */
#define IFX_PSI5_RMIOV_RMI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI25 */
#define IFX_PSI5_RMIOV_RMI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI25 */
#define IFX_PSI5_RMIOV_RMI25_OFF (25u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI26 */
#define IFX_PSI5_RMIOV_RMI26_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI26 */
#define IFX_PSI5_RMIOV_RMI26_MSK (0x1u)

